{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": false
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "H": 5,
      "Li": 6,
      "Be": 7,
      "B": 8,
      "C": 9,
      "N": 10,
      "O": 11,
      "F": 12,
      "Na": 13,
      "Mg": 14,
      "Al": 15,
      "Si": 16,
      "P": 17,
      "S": 18,
      "Cl": 19,
      "K": 20,
      "Ca": 21,
      "Sc": 22,
      "Ti": 23,
      "V": 24,
      "Cr": 25,
      "Mn": 26,
      "Fe": 27,
      "Co": 28,
      "Ni": 29,
      "Cu": 30,
      "Zn": 31,
      "Ga": 32,
      "Ge": 33,
      "As": 34,
      "Se": 35,
      "Br": 36,
      "Rb": 37,
      "Sr": 38,
      "Y": 39,
      "Zr": 40,
      "Nb": 41,
      "Mo": 42,
      "Tc": 43,
      "Ru": 44,
      "Rh": 45,
      "Pd": 46,
      "Ag": 47,
      "Cd": 48,
      "In": 49,
      "Sn": 50,
      "Sb": 51,
      "Te": 52,
      "I": 53,
      "Cs": 54,
      "Ba": 55,
      "Lu": 56,
      "Hf": 57,
      "Ta": 58,
      "W": 59,
      "Re": 60,
      "Os": 61,
      "Ir": 62,
      "Pt": 63,
      "Au": 64,
      "Hg": 65,
      "Tl": 66,
      "Pb": 67,
      "Bi": 68,
      "Po": 69,
      ".": 70
    }
  }
}